/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = "לומדת בטיחות";

// אובייקט המכיל את כל המידע של הלומדה הכולל את התוכן, השאלות לכל נושא וכמות השאלות שיילקח מכל נושא למבחן
const DATA = { 
    // נושא
    'בטיחות בדרכים': {
        "icon": "../assets/images/icons_subjects/car.svg",
        // שאלות לנושא הזה
        "questions": [ 
            {
                type: "multiple",
                question: "יצאת הביתה ולא קיבלת תדריך יציאה ממפקדך. כיצד תנהג?",
                ans1: 'אזכר בנקודות מתדריך יציאה שקיבלנו שבוע שעבר.',
                ans2: "אצלצל אליו ואודיע לו שלא תודרכתי.",
                ans3: 'אני סגל ומתדרך חיילים בעצמי, ולכן אני לא צריך תדר"צ.',
                ans4: "אוודא שאני מדוגם לפי הפקודות.",
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: "לפני מעבר חצייה עליך בתוך נהג?",
                ans1: 'לנסוע רגיל. אולי להאט טיפה, אך זכותי לעבור.',
                ans2: "להאט ולהסתכל שאף אחד לא רוצה לחצות.",
                ans3: 'להאט ולתת למי שמתכוון לעבור.',
                ans4: "תשובות ב' וג' נכונות.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "האם מותר לדבר בטלפון הנייד בנסיעה ברכב פרטי? (אתה הנהג)",
                ans1: 'כן בהחלט. כל עוד הנייד מוחזק על ידי נוסע צמוד לאוזן הנהג.',
                ans2: "כן, ברכב פרטי מותר לדבר בנייד.",
                ans3: 'לא, אלא אם הטלפון בדיבורית תקנית והמכשיר מוחזק במתקן קבוע.',
                ans4: "לא, אסור לדבר בטלפון הנייד בנסיעה.",
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: "עליך לנהוג לרמת הגולן וישנת 5 שעות בלילה. מה תעשה?",
                ans1: 'אצא למשימה ואעצור לרענונים ואסיים את המשימה.',
                ans2: "אצא למשימה ואעצור לישון בצד הדרך כדי להשלים שעות שינה.",
                ans3: "אודיע למפקד כדי שידאג שיהיה איתי מפקד עירני ואסע בזהירות.",
                ans4: 'אודיע למפקד המשלח שלא ישנתי 7 שעות שינה ולא אצא למשימה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'כמה מותר לך לשתות ולנהוג בסופ"ש?',
                ans1: 'חל איסור מוחלט על חיילים לשתות כל כמות ולנהוג.',
                ans2: `מעל משקל 60 ק"ג מותר לשתות כוסית על בטן מלאה.`,
                ans3: "בירה לא באמת משפיעה על הנהיגה שלי.",
                ans4: 'במשקל 70 ק"ג כוס יין אחת לא משפיעה.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'אתה נוסע בכביש מהיר בחורף והראות לא טובה. מה תעשה?',
                ans1: 'אסע לאט, אדאג להפשיר אדים ובמידת הצורך אעצור בתחנת רענון או תחנת דלק.',
                ans2: 'אסע באופן מותאם לתנאי הדרך.',
                ans3: 'אדליק מזגן על חום כדי להפשיר אדים.',
                ans4: 'אסע רגיל. ואשים לב שאני לא עובר את המהירות המותרת.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'עליך לפנות חייל למיון בשעה 18:00 בימים אלו - מה עליך לעשות?',
                ans1: 'אקבל תדריך מקצין זמין ואקח את החייל למיון עם הנהג התורן.',
                ans2: 'אקבל תדריך ואישור סא"ל אחרי השעה 17:00.',
                ans3: 'אקבל תדריך ואוודא שיש מלווה לחייל.',
                ans4: 'אקבל תדריך ואישור מהממ"ג (סא"ל) אחרי השעה 16:00.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'נתקעת עם הרכב בכביש 6 צפונה. כיצד תפעל? (רכב לא מניע)',
                ans1: 'אעצור בצד הדרך קרוב ככל האפשר למעקה הבטיחות.',
                ans2: 'אצלצל לשירותי בדרך של כביש 6 ואמתין להם.',
                ans3: 'אעבור מעבר למעקה הבטיחות יחד עם כל נוסעי הרכב.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'אתה נוסע באופנוע לבסיס. האם צריך אישור לכך?',
                ans1: 'לא. משום שהדרך מהבית לבסיס מתחת ל-100 ק"מ.',
                ans2: 'כן. מפקד הבה"ד חייב לאשר לי בכתב הגעה באופנוע לבסיס.',
                ans3: 'אין צורך באישור שכן מדובר ברכוש פרטי.',
                ans4: 'כן. מפקד המגמה צריך לאשר לי בכתב הגעה באופנוע לבסיס.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'מהן ההנחיות לתנועה כללית בבה"ד?',
                ans1: 'לחצות כבישים בריצה, לפני שתגיע מלגזה או משאית בדרך.',
                ans2: 'לנוע במהירות על מנת שמשאות לא יפלו עלי.',
                ans3: 'לנוע רק על מדרכות, לחצות במעברי חציה (במידה וישנם), אין לעבור מתחת למטען מונף.',
                ans4: 'לנוע לכיוון המתקן בדרך הקצרה ביותר.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'בנהיגה בשטח תפעולי בתוך הבסיס:',
                ans1: 'חוקי התעבורה אינם חלים על הנהג.',
                ans2: 'חוקי התעבורה חלים על כל נוהג בכל רכב, מהירות הנסיעה על פי התמרורים.',
                ans3: 'יש לנסוע לאט.',
                ans4: 'יש לנסוע לכיוון המתקן בדרך הקצרה ביותר.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'כמה בעלי תפקידים נדרשים לשילוח משימת נהיגה בבה"ד?',
                ans1: 'מפקד משלח, מפקד נסיעה שהוסמך, נהג.',
                ans2: 'מפקד נסיעה, מפקד משלח, נוסע ונהג.',
                ans3: 'מפקד בעל שרוך, נהג, נוסע',
                ans4: 'מפקד שעבר הכש"ם, נהג, מפקד משלח.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: ' מי מוסמך לשלח משימה בבה"ד ?',
                ans1: 'כל קצין ונגד בבה"ד.',
                ans2: 'רק דרגות כתף.',
                ans3: 'דרגת רס"ר וסרן  ומעלה לאחר שעברו הסמכה. רס"ל וסגן רשאים לשלח את עצמם בלבד.',
                ans4: 'קצין הרכב של הבה"ד לאחר שעבר הסמכה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מפקד הנסיעה אחראי על ?',
                ans1: 'ציר הנסיעה, מקומות חניה ועצירה, נסיעה בתנאי מז"א קיצוניים.',
                ans2: 'לוודא חגורות בטיחות, לענות לטלפונים, לרענן את הנהג, לשים רדיו.',
                ans3: 'ערנות הנהג, נסיעה לפי תנאי הדרך, הכוונה בנסיעה לאחור, הגעה ליעד בביטחה.',
                ans4: `תשובות ב' וג' נכונות.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'מהן שעות הנהיגה שעליך להקפיד עם הנהג במשימה עליה אתה מפקד?',
                ans1: '4 שעות נהיגה, שעתיים מנוחה עוד 4 שעות נהיגה 7 שעות שינה.',
                ans2: '4 שעות נהיגה, חצי שעה מנוחה, 4שעות נהיגה, שעתיים מנוחה, 4שעות נהיגה, 7 שעות שינה.',
                ans3: 'אין חובת שעות נהיגה עליך לוודא שהנהג ישן 7 שעות רצופות לפני משימת הניגה.',
                ans4: 'יש חובת וידוא 7 שעות שינה לפני משימת הנהיגה אך לא מפורט שעות מנוחה.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'מתי נדרש מפקד משלח משימה להגדיר זמני מנוחה ומיקום המנוחה?',
                ans1: 'לא נדרש להגדיר מיקום המנוחה שכן מדובר בנסיעות ארוכות לרוב אלא רק להגדיר זמנים.',
                ans2: 'לא נדרש להגדיר זמנים מדוייקים אלא פחות או יותר לפי התקדמות הנסיעה.',
                ans3: 'במהלך תכנון הנסיעה ובזמן התדריך למפקד ולנהג יוגדרו נקודות העצירה מדוייקות והזמנים .',
                ans4: 'במהלך התדריך יוגדרו הזמנים ותוך כדי הנסיעה בטלפון עם המפקד המשלח יקבעו המיקומי העצירה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'בזמן נסיעה לצפון על כביש בין עירוני מהיר ארעה תקר בגלגל הימני הקדמי.מה עליך לעשות?',
                ans1: 'מאחר ומדובר בגלגל הימני אציב משולש אזהרה, וסט זוהר ואתקן את התקר בעצמי.',
                ans2: 'אעצור בצמוד לשול הימנית, אציב משולש אזהרה, אצלצל למשטרת ישראל ולאחר הגעתם בלבד אתקן התקר.',
                ans3: 'עד להגעת המשטרה אמתין אני וכל נוסעי הרכב מעבר למעקה בטיחות .',
                ans4: `תשובות ב' וג' נכונות.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'על מי חלה חובה לבדוק ולוודא שכולם חגורים במשימה צבאית כולל באוטובוס?',
                ans1: 'על הנהג, על מפקד המשלח ועל הנוסעים(החיילים)',
                ans2: 'על הנוסעים ועל מפקד הנסיעה בלבד.',
                ans3: 'על מפקד המשלח, על מפקד הנסיעה, הנהג, ועל הנוסעים',
                ans4: 'על מפקד הנסיעה בלבד. הנהג עסוק בנהיגה והמשלח לא נמצא בזמן הנסיעה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'מי רשאי לשמש מפקד נסיעה בבה"ד?',
                ans1: 'כל איש סגל שמשרת בבה"ד מוסמך מהיותו סגל.',
                ans2: 'רק סגל הבה"ד שעבר הסמכה לפקד על המשימת נהיגה בבה"ד.',
                ans3: 'סגל הבה"ד שכבר ביצע משימות נהיגה בעבר.',
                ans4: 'סגל שעבר הסמכה בקורס הכש"ם בלבד.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'במהלך נסיעה באוטובוס בה הינך מפקד נסיעה הנהג מדבר מידי פעם בטלפון הנייד ללא דיבורית מה תעשה?',
                ans1: 'נהג האוטובוס שייך לחברה פרטית אין לי סמכות עליו.',
                ans2: 'אעיר לו שאסור אך לא אעצור את הנסיעה שכן הוא מבוגר ממני ויודע מה עושה.',
                ans3: 'אבקש/אדרוש להפסיק הדיבור בנייד מיידי ואדווח מיידי למפקד המשלח.',
                ans4: 'אבקש ממנו להפסיק את השיחה ואדאג לדווח למפקד המשלח בסיום הנסיעה.',
                correctAns: "ans3"
            },

        ],
        "learningContent": { 
            'בטיחות בדרכים': {
                "1) בטיחות בדרכים ": [ 
                    {
                        cardType: "youtube",
                        youtube: "https://www.youtube.com/embed/Sm_2ZhFu8rM"
                    },
                ],
                "2) בטיחות בדרכים ": [ 
                    {
                        cardType: "youtube",
                        youtube: "https://www.youtube.com/embed/bAS2QEVLTac"
                    },
                ],
                "3) בטיחות בדרכים ": [ 
                    {
                        cardType: "youtube",
                        youtube:"https://www.youtube.com/embed/lF7s665OweQ"
                    },
                ]
            }
           
        },
    },
    // נושא
    'הגנת הסביבה': {
        "icon":  "../assets/images/icons_subjects/sviva.svg",
        // שאלות לנושא הזה
        "questions": [ 
            {
                type: "multiple",
                question: 'אתה נמצא בשטח והייתה נזילת סולר לקרקע. מה תעשה?',
                ans1: 'אספוג את הסולר עם חול ואכסה כדי למנוע אירוע סביבתי.',
                ans2: 'אסמן את האזור כדי שאנשים לא יחליקו או יתלכלכו.',
                ans3: 'אספח את הסולר באמצעות סופחנים ואאגור את החול/אדמה הספוגה, כדי שלא ירד למי תהום.',
                ans4: 'אשפוך מים כדי לנקות את הכתם מעל פני הקרקע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם במקרה של אירוע סביבתי (שפך שמעל 5 ליטר חומר מסוכן לקרקע) חייב להודיע למישהו בבסיס?',
                ans1: 'לא.',
                ans2: 'בהחלט לא, אנקה בעצמי.',
                ans3: 'בהחלט כן, חובה להודיע לממונה הגנ"ס בבסיס.',
                ans4: 'קודם אטפל באירוע, אחר כך אם יש צורך אודיע לממונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי אחראי אחריות ישירה ופלילית על אירוע סביבתי?',
                ans1: 'החייל שגרם לאירוע.',
                ans2: 'החייל שגרם לאירוע ומפקד היחידה בה קרה האירוע.',
                ans3: 'מפקד היחידה בה קרה האירוע וממונה הגנ"ס יחידתי.',
                ans4: 'החייל שגרם לאירוע, מפקד היחידה בה קרה האירוע וממונה הגנ"ס יחידתי',
                correctAns: "ans2"
            }
        ],
        "learningContent": {
            "הגנת הסביבה": {
                "הגנת הסביבה": [
                    {
                        cardType: "youtube",
                        youtube:"https://www.youtube.com/embed/fkjKsXVB7Ro",
                    }
                ]
            }
        },
    },
    // נושא
    'טלטול והרמה': {
        "icon":  "../assets/images/icons_subjects/weights.png",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: 'במה תלוי המשקל שעובד יכול להרים?',
                ans1: 'גיל, גובה ומבנה הגוף.',
                ans2: '.מבנה גוף ומשקלו של החייל',
                ans3: ' מבנה גוף , מין, גיל העובד.',
                ans4: 'ביכולת העובד להרים אותו.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם יכול עובד להרים משקל גדול מהמותר בטבלאות שראית בסרטון בחלק הלמידה?',
                ans1: 'כן בהחלט, כל אדם והיכולת שלו.',
                ans2: 'כן בהחלט, תלוי במצב הגוף של העובד.',
                ans3: 'חל איסור מוחלט לחרוג מהמשקלים המצויינים בטבלה.',
                ans4: 'במקרים מסויימים כשאין ברירה, ניתן להרים יותר מהמותר.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם מפקד יכול להורות לחייל להרים משקל גדול מהמותר?',
                ans1: 'כן, בהנחה וזו פקודה.',
                ans2: 'לא.',
                ans3: 'כן, אם המשימה מצריכה זאת.',
                ans4: 'לא, אלא אם נעזר בחייל נוסף והמשקל מתחלק לנורמה תקינה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'עליך להעמיס משקל גדול למשאית הובלה שהוזמנה לך מראש ע"י המפקד. כיצד תפעל?',
                ans1: 'אעמיס המשקל הנדרש.',
                ans2: 'אבקש עזרה מחבר כדי לחלק את המשקל לערכים המותרים להרמה.',
                ans3: 'במידה והמשקל גדול מהמותר אשתמש במלגזה או מכונת הרמה .',
                ans4: `תשובות ב' וג' נכונות.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'על מי חלה אחריות לספק ציוד הרמה להרמת משקלים גדולים?',
                ans1: 'מפקד או מי מטעמו מחוייבים לספק ציוד הרמה ולהדריך העובדים להשתמש בו.',
                ans2: 'על העובד חלה חובה להשתמש בציוד זה לאחר שקיבל הדרכה ומכיר את הסיכונים.',
                ans3: ' אין כל חובה לספק ציוד הרמה בבסיסי צה"ל.',
                ans4: `תשובות א' ו-ב' נכונות.`,
                correctAns: "ans4"
            }
        ],
        "learningContent": {
            "טלטול והרמה": {
                "טלטול והרמה": [
                    {
                        cardType: "youtube",
                        youtube: "https://www.youtube.com/embed/RfNkJA3dWZ0",
                    }
                ]
            }
        }
    },
    // נושא
    'בטיחות בחשמל': {
        "icon":  "../assets/images/icons_subjects/electricity.svg",
        // שאלות לנושא הזה
        "questions": [
            {
                type: "multiple",
                question: 'טרם טיפול במערכת חשמל:',
                ans1: 'יש לוודא ניתוק חשמל.',
                ans2: 'יש לעבוד על נעלי בטיחות מבודדות חשמל.',
                ans3: 'היתר בטיחות, ניתוק, שילוט ונעילת מקור ההזנה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'מי רשאי לעבוד על מערכת חשמל בצבא?',
                ans1: '.כל חייל שיודע ומכיר את חוקי החשמל',
                ans2: 'רק חייל שהוסמך ובעל רישיון חשמל לפי מדרג הסמכות.',
                ans3: 'רק נגדים מוסמכים ובעלי רישיון חשמל לפי מדרג הסמכות.',
                ans4: 'חייל או נגד שקיבל כתב מינוי על ידי מפקד מוסמך.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'מתי נדרש לבצע בדיקת רציפות ארקה למתקן/מערכת חשמל ועל ידי מי?',
                ans1: 'כל חצי שנה לכלי חשמל מטלטלין וכל שנתיים למתקנים קבועים על ידי מהנדס חשמל.',
                ans2: 'כל שנה לכלי חשמל מטלטלין וכל שנתיים למתקנים קבועים על ידי הנדסאי חשמל.',
                ans3: 'כל שנה לכלי חשמל מטלטלין וכל חמש שנים למתקנים קבועים על ידי בודק חשמל מוסמך.',
                ans4: 'כל שנתיים למתקנים קבועים על ידי הנדסאי חשמל מוסמך.',
                correctAns: "ans3"
            },
        ],
        "learningContent": {
            "בטיחות בחשמל": {       
                "בטיחות בחשמל": [
                    {
                        cardType: "youtube",
                        youtube:"https://www.youtube.com/embed/QAbbFbTaabk",
                    }
                ]
            }
        },
    },
    // נושא
    'בטיחות בסדנאות': {
        "icon":  "../assets/images/icons_subjects/sadnaot.svg",
        // שאלות לנושא הזה
        "questions": [ 
            {
                type: "multiple",
                question: 'בדיקת בודק מוסמך למכונת הרמה ולאביזרי הרמה (בהתאמה) תתבצע כל:',
                ans1: 'אחרי שימוש ראשון ואחת ל14 חודשים, אחרי שימוש ראשון ואחת ל6 חודשים.',
                ans2: 'אחרי שימוש ראשון ואחת לשנה למכונה ולאביזרים.',
                ans3: 'טרם שימוש ראשון ואחת ל14 חודשים, טרם שימוש ראשון ואחת ל6 חודשים.',
                ans4: 'אחת ל-14 חודשים למכונה, אביזרים רק אחרי כל קלקול ותיקון.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מהן דרכי הפגיעה האפשריות לאדם מחומרים מסוכנים?',
                ans1: 'התזה על בגדי העבודה ועל ציוד המגן האישי.',
                ans2: 'בליעה, נשימה, התזה לעור, התזה לעיניים.',
                ans3: 'בליעה ונגיעה בלבד',
                ans4: 'נגיעה.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'עבודה לאורך שנים בתנאים לא נוחים מבחינה ארגונומית עלולה לגרום ל:',
                ans1: 'אי נוחות מתמשכת.',
                ans2: 'תאונת עבודה.',
                ans3: 'פגיעות מיקרוטראומה מצטברות אשר עלולות להתבטא בין היתר גם בבעיות שריר ושלד.',
                ans4: 'מחלות מקצוע.',
                correctAns: "ans4"
            },
        ],
        "learningContent": {
            "בטיחות בסדנאות": {       
                "בטיחות בסדנאות": [
                    {
                        // cardType: "video",
                        // video: "../assets/images/videos&photos/vid8.mp4",
                        cardType: "youtube",
                        youtube: "https://www.youtube.com/embed/Lym1vfjwFAE"
                    }
                ]
            },
        },
    },
    // נושא
    'בטיחות בגובה': {
        "icon":  "../assets/images/icons_subjects/height.svg",
        // שאלות לנושא הזה
        "questions": [ 
            {
                type: "multiple",
                question: 'הגדר מהי עבודה בגובה:',
                ans1: 'כל מקום ממנו עלול אדם ליפול לעומק העולה על 2 מטר.',
                ans2: 'כל מקום ממנו עלול אדם ליפול לעומק העולה על 3 מטר.',
                ans3: 'כל עבודה על סולם גבוה, פיגום או בימה.',
                ans4: 'כל מקום מעל פני הקרקע העולה על 2 מטרים.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'מהם הכללים הבסיסיים לעבודה על סולם?',
                ans1: 'חייל שהוסמך והודרך לעבוד בגובה ע"י מדריך מוסמך.',
                ans2: 'כל חייל צה"ל מוסמך לעבוד בגובה.',
                ans3: 'רק חיילים שעברו תדריך בטיחות לפני עבודה בגובה.',
                ans4: 'אף תשובה אינה נכונה.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'מי רשאי לעבוד עבודה בגובה?',
                ans1: 'חייל שהוסמך והודרך לעבוד בגובה ע"י מדריך מוסמך.',
                ans2: 'כל חייל צה"ל מוסמך לעבוד בגובה.',
                ans3: 'רק חיילים שעברו תדריך בטיחות לפני עבודה בגובה.',
                ans4: 'אף תשובה אינה נכונה.',
                correctAns: "ans1"
            },
        ],
        "learningContent": {
            "גובה": {       
                "גובה": [
                    {
                        cardType: "youtube",
                        youtube: "https://www.youtube.com/embed/xZr1u1NOPjw",
                    }
                ]
            }
        },
    },
    // נושא
    'בטיחות באש': {
        "icon":  "../assets/images/icons_subjects/fire.svg",
        // שאלות לנושא הזה
        "questions": [ 
            {
                type: "multiple",
                question: ' הגעת למשרדך והבחנת בשריפה בפח אשפה מה תעשה?',
                ans1: 'אשתמש בדלי מים של המנקה ואכבה השריפה.',
                ans2: 'אשתמש במטף כיבוי שנמצא בארון כיבוי אש.',
                ans3: 'לא אעשה כלום בשביל זה יש צוות התערבות.',
                ans4: 'אצלצל לחמ"ל להודיע שיש שריפה במשרד.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: ' האם מותר להשתמש במפצל חשמלי לבן בבה"ד או בצבא? ',
                ans1: 'לא',
                ans2: 'כן',
                ans3: 'כן באישור המפקד.',
                ans4: 'כן אם יש לו תו תקן ונבדק.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'האם מותר להשתמש בצינורות כיבוי אש לטובת שטיפת רצפות בבה"ד?',
                ans1: 'אסור בתכלית להשתמש בציוד כיבוי אש שלא לכיבוי שריפה.',
                ans2: 'מותר רק לעובדי הזכיין.',
                ans3: 'מותר באישור מפקד.',
                ans4: 'אם זה לטובת רצפה של סדנא אז מותר.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'החורף בפתח והמזגן לא מחמם מספיק. האם מותר לך להביא מפזר חום מהבית?',
                ans1: 'כן בהחלט.',
                ans2: 'לא בהחלט.',
                ans3: 'מותר לחתום על מפזר חום שהצבא מספק בלבד.',
                ans4: 'הזכיין מחוייב לספק ואם לא אני אביא מהבית.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'למי מותר לרתך בבה"ד ?',
                ans1: 'לכל מי שיודע לרתך.',
                ans2: 'כל מי שיש לו רתכת.',
                ans3: 'רק מי שהוסמך לרתך ויש לו כתב מינוי.',
                ans4: 'לכל נגד או קצין שיודע לרתך.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'האם מותר לעשות מנגל בשטח היחידה?',
                ans1: 'כן באישור מפקד הבה"ד בלבד, לאחר הצבת צופה אש עם מטף צמוד.',
                ans2: 'לא .חל איסור מוחלט על הדלקת מנגל בבסיסי צה"ל.',
                ans3: 'כן.',
                ans4: 'לא.',
                correctAns: "ans1"
            },
            {
                type: "multiple",
                question: 'הגעת למבנה/סדנא וראית כי משתוללת שריפה גדולה במבנה מה תעשה?',
                ans1: 'אצלצל מיד לחמ"ל ואודיע על שריפה.',
                ans2: 'אנסה לחפש אנשים ומקומות בהם ישנם לכודים.',
                ans3: 'אמנע מחיילים להתקרב לאיזור השריפה.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'האם מותר להדליק אש בשטח היחידה?',
                ans1: 'כן.',
                ans2: 'לא.',
                ans3: 'מותר באישור מפקד.',
                ans4: 'חל איסור מוחלט על הדלקת אש בשטחי היחידה.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'האם מותר לעשן במשרדים או בחדרים בבה"ד? ',
                ans1: 'חל איסור מוחלט על עישון במשרדים או בחדרים.',
                ans2: 'מותר לעשן באישור מפקד.',
                ans3: 'במידה ואת/ה לבד במשרד מותר.',
                ans4: 'אם לא רואים ולא מריחים אז מותר.',
                correctAns: "ans1"
            },
    
        ],
        "learningContent": {
            "בטיחות באש": {       
                "בטיחות באש": [
                    {
                        cardType: "youtube",
                        youtube: "https://www.youtube.com/embed/6iCNYJuISoY",
                    }
                ]
            }
        },
    },
    // נושא
    'בטיחות ברעש': {
        "icon":  "../assets/images/icons_subjects/headphones.png",
        // שאלות לנושא הזה
        "questions": [ 
            {
                type: "multiple",
                question: 'נזקי הרעש לאדם יכולים להיות?',
                ans1: 'פגיעה בשמיעה ונזקים פיזיולוגים כגון האצת קצב הדופק, לחץ דם מוגבר.',
                ans2: 'ירידה בשמיעה.',
                ans3: 'הפרעה למהלך התקין של עבודתך.',
                ans4: 'כל התשובות נכונות.',
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'שימוש באטמי אוזניים לא נוח. האם חובה להשתמש בהם באופן קבוע בעת עבודה ברעש?',
                ans1: `כן. כל עוד מקור הרעש פועל טנק/נגמ"ש/משאית ריו/משחזת יד וכו' חובה להשתמש באטמים ואף באוזניות.`,
                ans2: 'לא חייבים להשתמש באטמי אוזניים כל הזמן אלא אם זה ממש מפריע וגורם לצפצופים בשתי האוזניים.',
                ans3: 'חייבים להשתמש במיגון לאוזניים רק במקומות שהחוק מגדיר שהם מקומות עבודה ברעש מזיק.',
                ans4: `תשובות א' וג' הן התשובות נכונות בלבד.`,
                correctAns: "ans4"
            },
            {
                type: "multiple",
                question: 'האם מוזיקה במועדונים וברים יכולה להזיק לאדם כמו הרעש מטנק מונע או רעש מירי בנשק קל?',
                ans1: 'ממש לא. מוזיקה הרבה יותר נעימה לאוזן ועל כן אינה יכולה לגרום לנזקי שמיעה',
                ans2: 'בהחלט כן. כל רעש שהוא מעל 85 דציבל מזיק לשמיעה אם לא משתמשים באמצעי מיגון.',
                ans3: 'לא. רעש מטנק מונע מגיע ל-150 דציבל בעוד שבמועדונים המוזיקה מגיעה רק ל-130 דציבל.',
                ans4: 'בכלל לא מוזיקה לא מזיקה לאוזן האדם רק רעש מזיק גורם לבעיות שמיעה בהמשך.',
                correctAns: "ans2"
            },

            {
                type: "multiple",
                question: 'במהלך המטווחים הבחנת שאחד החיילים טווח בלי אטמים מה תעשה?',
                ans1: 'לא עושה כלום ממשיך את המטווח כרגיל עמידה בלו"ז לא פחות חשובה.',
                ans2: 'עוצר את המטווח, מודיע למפקד ומפנה החייל לבדיקת שמיעה בהקדם.',
                ans3: 'ממשיך כרגיל - עמידה בלו"ז חשובה יותר.',
                ans4: 'החייל אחראי לשים אטמי אוזניים זו בעיה שלו.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'עליך להניע כלי רק"מ כדי להזיזו בסדנא ואין בהישג קסדת גינטקס מה תעשה?',
                ans1: 'אשים אטמי אוזמיים רגילים ואסיע את הכלי מהסדנא.',
                ans2: 'אשים בוקסות למניעת נזקי רעש ואבצע המשימה.',
                ans3: 'חל איסור מוחלט להניע כלי רק"מ בבה"ד ללא קסדת גינטקס.',
                ans4: 'אקרא לחייל אחר שיניע הרק"מ ואני אתרחק כדי לא להיפגע.',
                correctAns: "ans3"
            },
            {
                type: "multiple",
                question: 'כל כמה זמן נדרש חייל העובד ברעש (מעל 85 דציבל) לבצע בדיקת שמיעה?',
                ans1: 'כל שנתיים אצל רופא אף אוזן גרון.',
                ans2: 'כל שנה אצל רופא תעסוקתי בחר"פ.',
                ans3: 'כל חצי שנה לפי דרישת החוק.',
                ans4: 'אין בבה"ד עובדים ברעש על כן לא נדרשת בדיקת שמיעה.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: 'התחלת לשמוע צפצופים באוזן שמאל אחרי שעבדת בסדנא ליד משאית ריו מונעת מה עליך לעשות? ',
                ans1: 'משאית ריאו לא מייצרת כל כך הרבה רעש -אין טעם להתייחס לזה.',
                ans2: 'משאית ריאו מייצרת רעש גבוה ועל כן בכל שינוי במצב השמיעה יש לפנות לרופא היחידה ולהודיע למפקדים.',
                ans3: 'משאיות ככלל לא מייצרות רעש מזיק כמו הרק"מ לכן הכל תקין.',
                ans4: 'הצפצוף יכול להיות ממועדון שביליתי לפני תקופת הקורונה אין טעם לבדוק.',
                correctAns: "ans2"
            },
            {
                type: "multiple",
                question: ' האם עבודה ברעש נמוך מ-85 דציבל לאורך זמן יכולה לגרום נזק בריאותי לעובד?',
                ans1: 'כן. רעש הוא גורם מזיק ויכול להשפיע על מצב הרוח , לחץ נפשי ויכולת ריכוז העובד.',
                ans2: 'לא .רעש נמוך מ-דציבל אינו יכול להזיק כלל לעובד.',
                ans3: 'רק במקרים מסויימים ותלוי מאדם לאדם.',
                ans4: 'רעש בעוצמות כאלה איננו מזיק ומשפיע על העובד.',
                correctAns: "ans1"
            }
        
        ],
        "learningContent": {
            "בטיחות ברעש": {       
                "בטיחות ברעש": [
                    {
                        cardType: "youtube",
                        youtube: "https://www.youtube.com/embed/JIAcjX_0jB0"
                    }
                ]
            }
        },
    }    
};



/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
    }
}
CARD_TYPES.listDots3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}
CARD_TYPES.listNumbers3 = {
    init(card, json) {
        card.querySelector(".sub-title").innerHTML = json.subTitle;
        card.querySelector(".li1").innerHTML = json.li1;
        card.querySelector(".li2").innerHTML = json.li2;
        card.querySelector(".li3").innerHTML = json.li3;
    }
}

CARD_TYPES.youtube = {
    init(card, json) {
        card.querySelector(".youtube").src = json.youtube;
  
    }
}
